In [1]:
import numpy as np
import pandas as dp 
from numpy.random import randn

In [2]:
arr = np.array([[15,25,np.nan],[58,np.nan,np.nan],[85,np.nan,588]])

In [3]:
arr

array([[ 15.,  25.,  nan],
       [ 58.,  nan,  nan],
       [ 85.,  nan, 588.]])

In [4]:
df = dp.DataFrame(arr,index = ["Index1","Index2","Index3"],columns = ["Column1","Column2","Column3"])

In [5]:
df

        Column1  Column2  Column3
Index1     15.0     25.0      NaN
Index2     58.0      NaN      NaN
Index3     85.0      NaN    588.0

In [6]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [7]:
#nan olan tüm yapılarımız silindi...(tüm yapılarımızda en az 1 adet nan olduğu için elimizde yapı kalmadı)

In [8]:
df

        Column1  Column2  Column3
Index1     15.0     25.0      NaN
Index2     58.0      NaN      NaN
Index3     85.0      NaN    588.0

In [9]:
#df yapısıyla drop kullanırken inplance = true demediğimiz için işlemimiz güncellenmedi yani işlem sadece bir ana hapis edilmiş gibi düşüne biliriz yada bunu bir anlık drop similasyonu gibi düşünebiliriz.

In [11]:
df.dropna(axis=1)

        Column1
Index1     15.0
Index2     58.0
Index3     85.0

In [12]:
df

        Column1  Column2  Column3
Index1     15.0     25.0      NaN
Index2     58.0      NaN      NaN
Index3     85.0      NaN    588.0

In [13]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [14]:
df.dropna(thresh = 2)

        Column1  Column2  Column3
Index1     15.0     25.0      NaN
Index3     85.0      NaN    588.0

In [15]:
#burada minimum 2 adet nan olamyan yapılara dokunma dediğimiz için index1 ve index2 alabildik
#bu işlemi tam olmasada bir filtreleme yöntemi gibi düşünebiliriz...

In [16]:
#eğer buarada thresh = 3 dersek hiçbir veriyi alamayacağız çünkü 3 verisinin tamamı nan olmayan bir yapımız mevcut değil eğer yapımızı kurarken bir tane bu koşula uyan yapı kurmuş olsaydık sorumuzun boşluk(0) dan farklı bir cevabı olacaktı

In [17]:
df.dropna(thresh=3)

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [18]:
#thresh methodu aynı zamanda LOL isimli dünyanın en çok üyeye sahip oyununda hook adı verilen bir mekaniğe sahip şampiyonun ismidir.
#kancaya benzer bir silahı rakibi tutmak yada eylemsiz bırakmak ve eylemsiz bıraktığı şampiyona gitmek gibi bir özelliği bulunmaktadır.
#bizim buarada yaptığımız işlemin görsel olarak anlamak için göz atabilirsiniz.
#link = https://www.youtube.com/watch?v=Sv95nBi7ulQ

In [19]:
df.fillna(value=1.5)

        Column1  Column2  Column3
Index1     15.0     25.0      1.5
Index2     58.0      1.5      1.5
Index3     85.0      1.5    588.0

In [20]:
#burada nan oaln değerlerin yerine 1.5 değerini yerleştirdik.

In [21]:
df

        Column1  Column2  Column3
Index1     15.0     25.0      NaN
Index2     58.0      NaN      NaN
Index3     85.0      NaN    588.0

In [22]:
df.sum()

Column1    158.0
Column2     25.0
Column3    588.0
dtype: float64

In [24]:
df.sum().sum()

771.0

In [25]:
df.size

9

In [26]:
df.isnull().sum() #sadece ve sadece null değerleri sayıyor.

Column1    0
Column2    2
Column3    2
dtype: int64

In [27]:
df.isnull().sum().sum()

4

In [28]:
def calmean(df):
    totalsum = df.sum().sum()
    totalnum = df.size - df.isnull().sum().sum()
    return totalsum / totalnum

In [30]:
df.fillna(value=calmean(df))

        Column1  Column2  Column3
Index1     15.0     25.0    154.2
Index2     58.0    154.2    154.2
Index3     85.0    154.2    588.0

In [31]:
df

        Column1  Column2  Column3
Index1     15.0     25.0      NaN
Index2     58.0      NaN      NaN
Index3     85.0      NaN    588.0

In [32]:
df.fillna(value=calmean(df),inplace=True)

In [33]:
df

        Column1  Column2  Column3
Index1     15.0     25.0    154.2
Index2     58.0    154.2    154.2
Index3     85.0    154.2    588.0